In [2]:
import pandas as pd

#r dilinde 2005 yılında bulunup pythona ekledik
seriler ve dataframe

In [4]:
seri=pd.Series([1,2,3,4])
seri      # index nosunu da yazdı

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
type(seri)

pandas.core.series.Series

In [8]:
seri.dtype

dtype('int64')

In [9]:
seri.mean()  #aritmetik ortalama

2.5

In [10]:
seri.axes   # başlangıç,bitiş

[RangeIndex(start=0, stop=4, step=1)]

In [11]:
seri.size

4

In [12]:
seri.ndim  #boyut

1

In [14]:
seri.shape  # 4 satır

(4,)

In [15]:
seri.head(2)  # başlangıç

0    1
1    2
dtype: int64

In [16]:
seri.tail(2)  # son 2 değer

2    3
3    4
dtype: int64

In [17]:
seri.tail()  # son

0    1
1    2
2    3
3    4
dtype: int64

In [21]:
import numpy as np

In [22]:
seri=pd.Series(np.random.randint(3,17,size=20))
seri

0      9
1      7
2      5
3      5
4      7
5      6
6      5
7     10
8      5
9      6
10    13
11    14
12    11
13    13
14     3
15    12
16    10
17    11
18    14
19     7
dtype: int32

In [25]:
seri=pd.Series(np.random.randint(1,10,size=5))
seri

0    7
1    8
2    7
3    2
4    6
dtype: int32

In [27]:
seri.index=["a","b","c","d","e"]
seri

a    7
b    8
c    7
d    2
e    6
dtype: int32

In [29]:
seri["a":"c"]  # bua aralıktakiler

a    7
b    8
c    7
dtype: int32

In [30]:
seri

a    7
b    8
c    7
d    2
e    6
dtype: int32

In [31]:
seri["c":"e"]   # c ve e dahil getirdi

c    7
d    2
e    6
dtype: int32

In [33]:
seri1=pd.Series(np.random.randint(3,100, size=5))
seri2=pd.Series(np.random.randint(4,200, size=5))

In [35]:
seri3=pd.concat([seri1,seri2])
seri3        #index nosu 0 dan sonra tekrar 0 dan

0     52
1     35
2     81
3     32
4     57
0    145
1     39
2     91
3    122
4     48
dtype: int32

In [37]:
seri1=pd.Series(np.random.randint(3,100, size=5))
seri2=pd.Series(np.random.randint(4,200, size=10))

In [39]:
seri3=pd.concat([seri1,seri2],ignore_index=True)
seri3              # size önemli değil  veee ignore index düzenler

0      88
1      21
2      40
3      84
4      62
5      66
6     133
7      43
8     153
9      33
10     51
11    125
12    111
13     73
14     64
dtype: int32

In [40]:
seri.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [41]:
seri.keys

<bound method Series.keys of a    7
b    8
c    7
d    2
e    6
dtype: int32>

In [42]:
seri.values

array([7, 8, 7, 2, 6])

In [43]:
list(seri.items())

[('a', 7), ('b', 8), ('c', 7), ('d', 2), ('e', 6)]

In [45]:
8 in seri.values

True

In [47]:
"a" in seri

True

In [49]:
sözlük={"hello":"merhaba","age":"yaş","computer":"bilgisayar"}
seri=pd.Series(sözlük)
seri

hello          merhaba
age                yaş
computer    bilgisayar
dtype: object

In [50]:
seri.values

array(['merhaba', 'yaş', 'bilgisayar'], dtype=object)

In [51]:
seri.keys

<bound method Series.keys of hello          merhaba
age                yaş
computer    bilgisayar
dtype: object>

In [52]:
seri

hello          merhaba
age                yaş
computer    bilgisayar
dtype: object

In [53]:
list(seri.items())

[('hello', 'merhaba'), ('age', 'yaş'), ('computer', 'bilgisayar')]

In [56]:
seri=pd.Series(np.arange(1,10,2))
seri

0    1
1    3
2    5
3    7
4    9
dtype: int32

In [57]:
seri.std()      # standart sapma

3.1622776601683795

In [ ]:
seri.var()     # varyans sapma

In [58]:
seri.median()  #ortadaki sayı

5.0

In [65]:
seri=pd.Series(np.random.randint(3,100,size=9))
seri

0    24
1    63
2    67
3    79
4    86
5    31
6    18
7    41
8    17
dtype: int32

In [66]:
seri.mean()

47.333333333333336

In [67]:
seri.median()

41.0

In [69]:
seri.sort_values()

8    17
6    18
0    24
5    31
7    41
1    63
2    67
3    79
4    86
dtype: int32

In [70]:
seri.sort_values().median()  #ortadaki sayı tekse çiftse ortası yine

41.0

In [71]:
seri

0    24
1    63
2    67
3    79
4    86
5    31
6    18
7    41
8    17
dtype: int32

#### dataFrame veri için önemli

In [73]:
df=pd.DataFrame(np.random.randint(1,100,size=10))
df

    0
0  62
1   1
2  49
3  75
4  44
5  53
6  16
7  20
8  71
9  81

In [74]:
df=pd.DataFrame(np.random.randint(1,100,size=10),columns=["değer"])
df

   değer
0     31
1     55
2     28
3      6
4      9
5     59
6     85
7     34
8     10
9     58

In [76]:
df=pd.DataFrame(np.random.randint(1,100,size=(3,4)))
df

    0   1   2   3
0  75  11  64  57
1  54   7  49  67
2  50  40  68  97

In [80]:
df=pd.DataFrame(np.random.randint(1,100,size=(4,5)),
index=["a","b","c","d"],columns=["deg1","deg2","deg3","deg4","deg5"])
df

   deg1  deg2  deg3  deg4  deg5
a    31     6    44    65     1
b    18    19    43    16    70
c    25    57    64    78    67
d    22    70    74    54    95

In [81]:
type(df)

pandas.core.frame.DataFrame

In [82]:
df.dtypes   # object olarak aldı

deg1    int32
deg2    int32
deg3    int32
deg4    int32
deg5    int32
dtype: object

In [83]:
df.axes  # index ve colonları

[Index(['a', 'b', 'c', 'd'], dtype='object'),
 Index(['deg1', 'deg2', 'deg3', 'deg4', 'deg5'], dtype='object')]

In [84]:
df.size

20

In [85]:
df.shape

(4, 5)

In [86]:
df.ndim  # 2 boyut

2

In [87]:
df.values   # arraya çevirdi listeye çevirdi

array([[31,  6, 44, 65,  1],
       [18, 19, 43, 16, 70],
       [25, 57, 64, 78, 67],
       [22, 70, 74, 54, 95]])

In [88]:
df

   deg1  deg2  deg3  deg4  deg5
a    31     6    44    65     1
b    18    19    43    16    70
c    25    57    64    78    67
d    22    70    74    54    95

In [89]:
df.head(3)  # ilk üç satır

   deg1  deg2  deg3  deg4  deg5
a    31     6    44    65     1
b    18    19    43    16    70
c    25    57    64    78    67

In [90]:
df.tail(3)  # son üç satır

   deg1  deg2  deg3  deg4  deg5
b    18    19    43    16    70
c    25    57    64    78    67
d    22    70    74    54    95

In [96]:
s1=np.random.randint(1,100,size=5)
s2=np.random.randint(1,100,size=5)
s3=np.random.randint(1,100,size=5)

In [97]:
number={"var1":s1,"var2":s2,"var3":s3}

In [98]:
df=pd.DataFrame(number)
df

   var1  var2  var3
0    19    55    89
1    52    38    16
2    94    95    47
3    27    86    66
4    27    14    49

In [99]:
df=pd.DataFrame(number,index=[list("abcde")])
df                           # abcde yi atadı

   var1  var2  var3
a    19    55    89
b    52    38    16
c    94    95    47
d    27    86    66
e    27    14    49

In [100]:
df["var1"].mean()

43.8

In [103]:
df

   var1  var2  var3
a    19    55    89
b    52    38    16
c    94    95    47
d    27    86    66
e    27    14    49

In [104]:
df[0:2]

   var1  var2  var3
a    19    55    89
b    52    38    16

df[1,2]    # 1. satır 2. sütün olmadı

In [107]:
df.iloc[0]   # ilk satırı getirdi, sayısal verileri

var1    19
var2    55
var3    89
Name: (a,), dtype: int32

In [108]:
df.iloc[[0]]   #  dataframe şeklinde satır sayısı

   var1  var2  var3
a    19    55    89

In [110]:
df.loc["b":"d"]  # d yi getirdi index nosuna göre  önemliiiiiiiii

   var1  var2  var3
b    52    38    16
c    94    95    47
d    27    86    66

In [111]:
df.iloc[[3]]             # integer locasyon

   var1  var2  var3
d    27    86    66

In [112]:
df.loc[["d"]]             # indexte  locasyon

   var1  var2  var3
d    27    86    66

In [113]:
df.iloc[2:4,1:3]          #satır ve sütün

   var2  var3
c    95    47
d    86    66

In [115]:
df.loc["c":"d","var2":"var3"] # locta int yok index ve colon noları

   var2  var3
c    95    47
d    86    66

In [116]:
df.isnull()                  #null değer yok

    var1   var2   var3
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False
e  False  False  False

In [123]:
df=pd.DataFrame(np.random.randint(1,100,size=(3,4)))
df

    0   1   2   3
0  29   7  48  98
1   7  42  95  96
2  69  43   4  60

In [124]:
df.drop(0, axis=0) # kalıcı silmez  ilk satır

    0   1   2   3
1   7  42  95  96
2  69  43   4  60

In [126]:
df.drop(1) # kalıcı silmez  ilk satır

    0   1   2   3
0  29   7  48  98
2  69  43   4  60

In [129]:
df=pd.DataFrame(np.random.randint(1,100,size=(3,3)))
df

    0   1   2
0  35  85  67
1  58  71  87
2  90  52  86

In [130]:
df.drop(1,axis=0)  # 1. satır    axis 0 satır

    0   1   2
0  35  85  67
2  90  52  86

In [131]:
df.drop(1,axis=1)   #1. sütün    axis 1 sütün

    0   2
0  35  67
1  58  87
2  90  86

In [151]:
a=np.random.randint(3,20, size=(3,3))
b=np.random.randint(2,100, size=(5,3))

In [152]:
a

array([[10, 16, 10],
       [ 7,  7, 17],
       [13, 11, 11]])

In [153]:
b

array([[97, 66, 28],
       [10,  5, 77],
       [20, 68, 36],
       [34, 18,  2],
       [57, 47, 72]])

In [154]:
c=np.concatenate([a,b])
c

array([[10, 16, 10],
       [ 7,  7, 17],
       [13, 11, 11],
       [97, 66, 28],
       [10,  5, 77],
       [20, 68, 36],
       [34, 18,  2],
       [57, 47, 72]])

In [168]:
df=pd.DataFrame(c)
df

    0   1   2
0  10  16  10
1   7   7  17
2  13  11  11
3  97  66  28
4  10   5  77
5  20  68  36
6  34  18   2
7  57  47  72